In [1]:
import pandas as pd
import numpy as np

In [2]:
car=pd.read_csv('https://github.com/rajtilakls2510/car_price_predictor/raw/master/quikr_car.csv')

In [3]:
car.sample(15)

,name,company,year,Price,kms_driven,fuel_type
253,Hyundai Eon Sportz,Hyundai,2012,"1,78,000","30,000 kms",Petrol
500,Maruti Suzuki Wagon R LXI BS IV,Maruti,2014,"2,50,000","18,500 kms",Petrol
653,Hyundai Santro Xing GLS,Hyundai,2014,"1,79,000","57,000 kms",Petrol
296,Mahindra TUV300 T4 Plus,Mahindra,2016,"6,75,000","9,000 kms",Diesel
273,Renault Duster 85 PS RxL Diesel,Renault,2015,"5,49,999","19,000 kms",Diesel
741,Mahindra Xylo D2 BS IV,Mahindra,2011,"3,90,000","56,000 kms",Diesel
720,Hyundai Eon D Lite Plus,Hyundai,2018,"2,80,000","35,000 kms",Petrol
354,Hyundai Accent,Hyundai,2010,"99,999","45,000 kms",Petrol
79,Mini Cooper S 1.6,Mini,2013,"18,91,111","13,500 kms",Petrol
471,Tata Indigo CS eLS BS IV,Tata,2015,"1,23,000","1,00,000 kms",Diesel
117,Maruti Suzuki Ritz VXI,Maruti,2014,"2,99,999","19,000 kms",Petrol
650,Toyota Etios Liva Diesel,Toyota,2012,"3,50,000","85,000 kms",Diesel
392,Maruti Suzuki Swift,Maruti,2014,"3,35,000","55,000 kms",Diesel
427,Nissan X Trail Select Variant,Nissan,2019,"12,00,000",300 kms,Diesel
81,Mahindra Scorpio VLX 2WD BS IV,Mahindra,2014,"6,99,000","50,000 kms",Diesel

In [4]:
car.shape

(892, 6)

In [5]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

In [6]:
car['year'].unique()

array(['2007', '2006', '2018', '2014', '2015', '2012', '2013', '2016',
       '2010', '2017', '2008', '2011', '2019', '2009', '2005', '2000',
       '...', '150k', 'TOUR', '2003', 'r 15', '2004', 'Zest', '/-Rs',
       'sale', '1995', 'ara)', '2002', 'SELL', '2001', 'tion', 'odel',
       '2 bs', 'arry', 'Eon', 'o...', 'ture', 'emi', 'car', 'able', 'no.',
       'd...', 'SALE', 'digo', 'sell', 'd Ex', 'n...', 'e...', 'D...',
       ', Ac', 'go .', 'k...', 'o c4', 'zire', 'cent', 'Sumo', 'cab',
       't xe', 'EV2', 'r...', 'zest'], dtype=object)

In [7]:
# quality

# -Year has many none_year value
# -year object to int 
# -price has ask for price 
# -price has , 
# -kms_driven has kms with integers
# -kms_driven object to int 
# -kms_driven has nan value
# -fuel_type has nan value 
# -keep first 3 words of name

# cleaning

In [8]:
backup=car.copy()

In [9]:
#1
car = car[car['year'].str.isnumeric()]

In [10]:
#2
car['year']=car['year'].astype(int)

In [11]:
car.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 842 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        842 non-null    object
 1   company     842 non-null    object
 2   year        842 non-null    int32
 3   Price       842 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: int32(1), object(5)
memory usage: 42.8+ KB

In [12]:
#3
car = car[car['Price']!='Ask For Price']

In [13]:
#4
car['Price']=car['Price'].str.replace(',','').astype(int)

In [14]:
car.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 819 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        819 non-null    object
 1   company     819 non-null    object
 2   year        819 non-null    int32
 3   Price       819 non-null    int32
 4   kms_driven  819 non-null    object
 5   fuel_type   816 non-null    object
dtypes: int32(2), object(4)
memory usage: 38.4+ KB

In [15]:
#5
car['kms_driven']=car['kms_driven'].str.split(' ').str.get(0).str.replace(',','')

In [16]:
#6
car=car[car['kms_driven'].str.isnumeric()]

In [17]:
#7
car['kms_driven'] = car['kms_driven'].astype(int)

In [18]:
car.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 817 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        817 non-null    object
 1   company     817 non-null    object
 2   year        817 non-null    int32
 3   Price       817 non-null    int32
 4   kms_driven  817 non-null    int32
 5   fuel_type   816 non-null    object
dtypes: int32(3), object(3)
memory usage: 35.1+ KB

In [19]:
#8
car=car[~car['fuel_type'].isna()]

In [24]:
#9
car['name']=car['name'].str.split(' ').str.slice(0,3).str.join(' ')

In [28]:
car=car.reset_index(drop=True)

In [29]:
car.sample(10)

                         name    company  year   Price  kms_driven fuel_type
386  Hyundai Sonata Transform    Hyundai  2017  190000       36469    Diesel
346     Mahindra Bolero Power   Mahindra  2018  699000        1800    Diesel
27         Mahindra Bolero DI   Mahindra  2017  180000       23452    Diesel
715       Chevrolet Tavera LS  Chevrolet  2005  130000       68485    Diesel
61     Ford EcoSport Ambiente       Ford  2016  830000       24530    Diesel
63       Mahindra Scorpio SLE   Mahindra  2012  570000       19000    Diesel
279            Fiat Petra ELX       Fiat  2008   75000       65000    Petrol
685          Mahindra Xylo D2   Mahindra  2011  390000       48000    Diesel
120           Chevrolet Spark  Chevrolet  2012  158400       33600    Petrol
624     Chevrolet Beat Diesel  Chevrolet  2016  179999       19336    Diesel

In [30]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        816 non-null    object
 1   company     816 non-null    object
 2   year        816 non-null    int32
 3   Price       816 non-null    int32
 4   kms_driven  816 non-null    int32
 5   fuel_type   816 non-null    object
dtypes: int32(3), object(3)
memory usage: 28.8+ KB

In [31]:
car.describe()

              year         Price     kms_driven
count   816.000000  8.160000e+02     816.000000
mean   2012.444853  4.117176e+05   46275.531863
std       4.002992  4.751844e+05   34297.428044
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.750000e+05   27000.000000
50%    2013.000000  2.999990e+05   41000.000000
75%    2015.000000  4.912500e+05   56818.500000
max    2019.000000  8.500003e+06  400000.000000

In [36]:
#outlier
car=car[car['Price']<6e6].reset_index(drop=True)

In [37]:
car.sample(5)

                        name   company  year   Price  kms_driven fuel_type
518      Maruti Suzuki Swift    Maruti  2009  150000       45000    Petrol
550  Jeep Wrangler Unlimited      Jeep  2015  950000        3528    Diesel
814       Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel
298      Maruti Suzuki Dzire    Maruti  2012  299999       40000    Petrol
562       Tata Indigo Marina      Tata  2004  180000       70000    Diesel

In [38]:
car.to_csv('cleaned_car.csv')